# Pandas Practice – My Solution
This notebook contains my solutions for pandas practice tasks.

In [1]:
import pandas as pd

## Part 1 – Purchase Data

In [2]:
df_data = pd.read_csv('Data/Purchase_Data.csv')
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

In [3]:
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

In [4]:
result_1 = df_data.loc[:, df_data.columns[:2]]
result_1.head()

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

In [5]:
result_2 = df_data.loc[:1]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

In [6]:
result_3 = df_data.loc[:3, df_data.columns[:5]]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

In [7]:
result_4 = df_data.loc[[0,4,6], ['invoice_time','price']]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

In [8]:
num_rows = len(df_data)
num_rows

5382

In [9]:
df_data.iloc[[num_rows-1]]

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

## Part 2 – Statistics

In [10]:
avg_price = df_data['price'].mean()
max_price = df_data['price'].max()
avg_price, max_price

(np.float64(3.1920522110741363), np.float64(6.01))

In [11]:
avg_price, avg_num_items = df_data[['price','num_item']].mean()
avg_price, avg_num_items

(3.1920522110741363, 1.2983091787439613)

In [12]:
df_data['total'] = df_data['price'] * df_data['num_item']
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

In [13]:
df_data.sort_values('total', ascending=False).head(3)['total'].mean()

np.float64(164.0)

In [14]:
df_data['product_id'].nunique()

53

In [15]:
desc = df_data['total'].describe()
desc['mean'] - desc['50%']

np.float64(0.9318078781127839)

In [16]:
df_data.drop(columns=['total'], inplace=True)

In [17]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   object
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
dtypes: float64(3), int64(2), object(2)
memory usage: 294.5+ KB

In [18]:
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
df_data['DOW'] = df_data['invoice_time'].dt.day_name()
df_data['Month'] = df_data['invoice_time'].dt.month
df_data.head()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_14980\284484403.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,7

In [19]:
df_data['DOW'].value_counts()['Wednesday']

np.int64(959)

## Part 3 – Titanic Data

In [20]:
df_titanic = pd.read_csv('Data/Titanic.csv')
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [21]:
df_titanic.rename(columns={'Name':'Passenger_Name','Ticket':'Ticket_Num'}, inplace=True)

In [22]:
df_titanic.set_index('PassengerId', inplace=True)
df_titanic.loc[896, 'Passenger_Name']

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

In [23]:
df_titanic.reset_index(inplace=True)

In [24]:
df_titanic['Age'].isnull().sum()

np.int64(86)

In [25]:
age_avg = df_titanic['Age'].mean()
df_titanic['Age'].fillna(age_avg, inplace=True)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_14980\1968352206.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_titanic['Age'].fillna(age_avg, inplace=True)

In [26]:
df_titanic.sort_values('Age', ascending=False).head(5)['Age'].mean()

np.float64(67.0)